{"gaussianStdHelp": "The image is normalized with a gaussian filter of a certain standard deviation.\nThis standard deviation can be seen as the 'size' of the filter.\nThe default value might be good enough in a lot of cases.\nThis normalization is good to remove intensity gradient or non uniformity.\nImportant: If there is no intensity gradient, it may be the best to put \"0\", which is a special case where no gaussian filter is applied.",
"medianFilterSizeHelp": "The image is filtered with a median filter of a certain size.\nThis size is important if the noise is intense, because a small filter may not be optimal.\nFor small salt & pepper noise, a filter of a few pixels (less than 10) me be good enough.\nThe default value may be good.\nThis filter is  important for speckle imaging, because there can be photon noise. ",
"localContrastSizeHelp": "The computation of the local contrast requires a kernel size that determines the number of neighbors used to compute the local contrast.\nThe local contrast may be an interesting and important parameter in speckle imaging.\nThe local contrast kernel is based on the method used by Donald D. Duncan and al. in Statistics of local speckle contrast.",
"intensityHistBinsHelp": "The image intensity can be represented by an histogram.\nTo do so, a number of bins is required.\nThis number can be seen as the 'precision' of the histogram: if it is a small number, we may not have a good overview of the speckle intensity distribution.\nHowever, using a big number may have the same effect: if it is too large, we may have empty bins.\nThe default value may be enough for images encoded in 8 bits unsigned integers, of floats.\nWe can extract statistical properties of the speckles with this graph.\nWe can extract statistical properties of the speckles with this graph.",
"localContrastBinsHelp": "The local contrast value can be represented as an histogram.\nTo do so, a number of bins is required.\nThis number can be seen as the 'precision' of the histogram: if it is a small number, we may not have a good overview of the speckle intensity distribution.\nHowever, using a big number may have the same effect: if it is too large, we may have empty bins.\nThe default value may be enough for images encoded in 8 bits unsigned integers, or floats.\nWe can extract statistical properties of the speckles with this graph",
"methodHelp": "There is currently two possible methods that can be used to find the average speckle diameter.\nThe speckle diameter is very close to the autocorrelation of the speckle image.\nSince the autocorrelation is discrete, there is not an absolute way to find the full or the half width at the half maximum\n(since the autocorrelation is normalized at a maximum of approximately 1, the half maximum is considered at 0.5).\n\nThe first method uses a certain range of neighbors (define by a percentage) of upper and lower neighbors. The mean value is then computed and this is the value that is kept to compute the average diameter.\n\nThe second method is close to the first one, but instead of taking the mean, a linear fit is done.",
"methodParamsHelp": "Neighbors method parameters:\nThe maximum range.\nIt is a number between 0 and 1 (a percentage) and it is used to find neighbors within 0.5 ± percentage.\n\nLinear fit method parameters:\nTme maximum number of neighbors.\nIt is an integer and it is used to find half this number of neighbors in the upper part (where y > 0.5) and the other half contains neighbors in the lower part (where y < 0.5).\nIn some cases, there may be not enough neighbors in the upper part, so that is why it is the maximum and not the absolute."}